<?php
declare(strict_types=1);
return array (
  'brand' => 
  array (
    'Intel' => 590,
    'AMD' => 590,
  ),
  'socket' => 
  array (
    'LGA1700' => 590,
    'AM5' => 443,
    'AM4' => 147,
  ),
  'cores' => 
  array (
    14 => 147,
    8 => 295,
    6 => 296,
    20 => 148,
    16 => 147,
    24 => 147,
  ),
  'threads' => 
  array (
    20 => 147,
    16 => 295,
    12 => 296,
    28 => 148,
    32 => 294,
  ),
  'tdp' => 
  array (
    '125 Вт' => 442,
    '120 Вт' => 148,
    '65 Вт' => 148,
    '105 Вт' => 295,
    '170 Вт' => 147,
  ),
);
